/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "Nilai tidak benar.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "Nilai %@ tidak benar.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Sila berikan nilai yang sah.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "Nilai tidak benar.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "Nilai %@ tidak benar.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "Nilai terlalu kecil.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "Nilai terlalu besar.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Sila berikan nilai yang sah.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Sila berikan nombor yang tidak kurang daripada %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Sila berikan nombor antara %1$@ dan %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Sila berikan nombor yang tidak melebihi %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "Nilai %@ terlalu kecil.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "Nilai %@ terlalu besar.";

/* NSFileLockingError */
"Err255-C" = "Fail tidak dapat dikunci.";

/* NSFileLockingError */
"Err255-R" = "Fail ini mungkin telah dikunci, atau anda tidak memiliki hak yang cukup untuk menguncinya.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Fail “%@” tidak dapat dikunci.";

/* NSFileReadUnknownError */
"Err256" = "Fail ini tidak dapat dibuka.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Fail “%@” tidak dapat dibuka.";

/* NSFileReadNoPermissionError */
"Err257" = "Fail tidak dapat dibuka kerana anda tidak diizinkan untuk melihatnya.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Anda tiada keizinan.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Untuk melihat atau menukar izin, pilih satu item di Finder dan pilih File > Get Info.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "“%@” fail tidak dapat dibuka kerana anda tidak diizinkan untuk melihatnya.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Nama fail ini tidak sah.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Item ini tidak dapat dibuka kerana nama fail “%@” tidak sah.";

/* NSFileReadCorruptFileError */
"Err259" = "Fail tidak dapat dibuka kerana tidak berada dalam format yang betul.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Fail ini tidak berada dalam format yang benar.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Fail ini mungkin rosak, terpotong, atau memiliki format yang berbeza dari yang anda harapkan. ";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Fail “%@” tidak dapat dibuka kerana tidak berada dalam format yang betul.";

/* NSFileReadNoSuchFileError */
"Err260" = "Fail ini tidak dapat dibuka kerana ia tidak wujud.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "Folder “%@” tidak wujud.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Fail tidak wujud.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "Folder tidak wujud.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Fail “%@” tidak dapat dibuka kerana fail tersebut tidak terdapat.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Fail ini tidak dapat dibuka menggunakan pengekodan teks yang telah ditentukan. ";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Pengekodan teks yang ditentukan adalah tidak berkenaan.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Pengkodan Teks %@ tidak dapat dilakukan.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Fail ini mungkin telah disimpan dengan menggunakan pengkodan teks yang berbeza, atau bukan berupa file teks.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Fail ini tidak dapat dibuka menggunakan pengkodan teks %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Fail “%2$@” tidak dapat dibuka menggunakan pengkodan teks %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Fail ini tidak dapat dibuka kerana jenis URL yang ditentukan tidak disokong. ";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Jenis URL yang ditentukan tidak disokong.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Fail “%1$@” tidak dapat dibuka kerana jenis URL %2$@ tidak disokong.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Fail tidak dapat dibuka kerana URL jenis %@ tidak disokong.";

/* NSFileReadTooLargeError */
"Err263" = "Item tidak dapat dibuka kerana ia terlalu besar.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Item terlalu besar.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Item “%@” tidak dapat dibuka kerana ia terlalu besar.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Fail ini tidak dapat dibuka kerana pengkodan teks kandungannya tidak dapat ditentukan.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Pengekodan teks kandungan tidak dapat ditentukan.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Mungkin fail dapat dibuka dengan menetapkan pengkodan teks.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Fail “%@” tidak dapat dibuka kerana pengekodan teks kandungannya tidak dapat ditentukan.";

/* NSUserCancelledError */
"Err3072-C" = "Operasi dibatalkan.";

/* NSFeatureUnsupportedError */
"Err3328" = "Operasi yang diminta tidak dapat diselesaikan kerana ciri tidak disokong.";

/* NSFeatureUnsupportedError, argument is a file name */
"Err3328(Trash).f" = "“%@” tidak dapat dipindahkan ke sampah kerana volum tidak memilikinya.";

/* NSFeatureUnsupportedError, argument is a file name and volume name */
"Err3328(Trash).fv" = "“%1$@” tidak dapat dipindahkan ke sampah kerana volum “%2$@” tidak memilikinya.";

/* NSFeatureUnsupportedError */
"Err3328-C" = "Operasi yang diminta tidak disokong.";

/* NSFeatureUnsupportedError */
"Err3328-C(Trash)" = "Volum tidak mempunyai sampah.";

/* NSPropertyListCorruptError */
"Err3840" = "Data tidak boleh dibaca kerana ia sudah rosak.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Data telah rosak.
";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Data tidak boleh dibaca kerana dalam format yang tidak difahami dengan aplikasi ini.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Data dalam format yang tidak difahami aplikasi ini.
";

/* NSPropertyListReadStreamError */
"Err3842" = "Data tidak boleh dibaca kerana ralat dalam sumber data.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Ralat berlaku dalam sumber data.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Data tidak boleh ditulis kerana ralat dalam tujuan ke data.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Ralat berlaku dalam tujuan ke data.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "Folder “%@” tidak wujud.";

/* NSFileNoSuchFileError, first arg: source file, second arg: destination file */
"Err4(Move).fp" = "“%1$@” tidak dapat dipindahkan ke “%2$@” kerana sama ada ia tidak wujud, atau folder yang mengandungi fail tidak wujud.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@” tidak dapat dikeluarkan.";

/* NSFileNoSuchFileError */
"Err4-C" = "Fail tidak wujud.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "Folder tidak wujud.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Fail “%@” tidak wujud.";

/* Message shown when the connection to a helper application is interrupted due to the helper application exiting. */
"Err4097" = "Tidak dapat berkomunikasi dengan aplikasi pembantu.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4097-R" = "Cuba operasi anda sekali lagi. Jika ia gagal, berhenti dan lancarkan semula aplikasi dan cuba lagi.";

/* Message shown when the connection to a helper application is interrupted and can not be reestablished. */
"Err4099" = "Tidak dapat berkomunikasi dengan aplikasi pembantu.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4099-R" = "Cuba operasi anda sekali lagi. Jika ia gagal, berhenti dan lancarkan semula aplikasi dan cuba lagi.";

/* Message shown when the connection to a helper application is invalidated due to a corrupted response. */
"Err4101" = "Tidak dapat berkomunikasi dengan aplikasi pembantu.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4101-R" = "Cuba operasi anda sekali lagi. Jika ia gagal, berhenti dan lancarkan semula aplikasi dan cuba lagi.";

/* NSFileWriteUnknownError */
"Err512" = "Fail ini tidak dapat disimpan.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "Fail \"%1$@\" tidak boleh disimpan kerana fail sandaran tidak dapat dikemaskini.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@” tidak dapat disalin ke “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@” tidak dapat disambungkan ke “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@” tidak dapat dipindahkan ke “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@” tidak dapat dikeluarkan.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Trash).f" = "“%@” tidak dapat dipindahkan ke sampah.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "Fail sandaran tidak dapat disimpan.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Fail sandaran mungkin telah dikunci atau anda tidak memiilki hak untuk menyimpannya. Untuk melihat atau menukar izin, pilih satu item di Finder dan pilih File > Get Info.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Fail “%2$@” tidak dapat disimpan dalam folder “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Fail “%@” tidak dapat disimpan.";

/* NSFileWriteNoPermissionError */
"Err513" = "Fail tidak dapat disimpan kerana anda tidak diizinkan untuk melihatnya.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%1$@” tidak dapat disalin kerana anda tidak diizinkan untuk mengakses  “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%1$@” tidak dapat disambungkan kerana anda tidak diizinkan untuk mengakses “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%1$@” tidak dapat dipindahkan kerana anda tidak diizinkan untuk mengakses  “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "“%@” tidak dapat dikeluarkan kerana anda tiada kebenaran untuk mengaksesnya.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Trash).f" = "“%@” tidak dapat dipindahkan ke sampah kerana anda tiada kebenaran untuk mengaksesnya.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Anda tiada keizinan.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Untuk melihat atau menukar izin, pilih satu item di Finder dan pilih File > Get Info.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Anda tiada keizinan untuk menyimpan fail “%2$@” dalam \"%1$@\" folder.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Anda tiada keizinan untuk menyimpan fail “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Item ini tidak dapat disimpan kerana nama fail tidak sah.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Item ini tidak dapat dikeluarkan kerana nama fail “%@” tidak sah.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Nama fail ini tidak sah.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Item ini tidak dapat disimpan kerana nama fail “%@” tidak sah.";

/* NSFileWriteFileExistsError */
"Err516" = "Fail tidak dapat disimpan kerana fail dengan nama yang sama telah wujud.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Copy).fp" = "“%1$@” tidak dapat disalin ke “%2$@” kerana item dengan nama yang sama telah wujud.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Link).fp" = "“%1$@” tidak dapat disambungkan ke “%2$@” kerana item dengan nama yang sama telah wujud.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Move).fp" = "“%1$@” tidak dapat dipindahkan ke “%2$@” kerana item dengan nama yang sama telah wujud.";

/* NSFileWriteFileExistsError */
"Err516-C" = "Fail dengan nama yang sama telah pun wujud.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516-C.f" = "Fail dengan nama “%@” telah pun wujud.";

/* NSFileWriteFileExistsError */
"Err516-R" = "Untuk menyimpan fail, sama anda berikan nama lain, atau alihkannya atau padam fail sedia ada dan cuba lagi.";

/* NSFileWriteFileExistsError, first arg: destination folder, second arg: a file name */
"Err516.df" = "Fail “%2$@” tidak dapat disimpan dalam folder \"%1$@\" kerana fail dengan nama yang sama telah wujud.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516.f" = "Fail “%@” tidak dapat disimpan kerana fail dengan nama yang sama telah wujud.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Fail ini tidak dapat disimpan menggunakan pengkodan teks yang telah ditentukan.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Pengekodan teks yang ditentukan adalah tidak berkenaan.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Pengkodan Teks %@ tidak dapat dilakukan.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Jika mungkin, pilih pengkodan teks lain.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Fail ini tidak dapat disimpan menggunakan pengkodan teks %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Fail “%2$@” tidak dapat disimpan menggunakan pengkodan teks %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Fail ini tidak dapat disimpan kerana jenis URL yang ditentukan tidak disokong. ";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Jenis URL yang ditentukan tidak disokong.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Fail “%1$@” tidak dapat disimpan kerana jenis URL %2$@ tidak disokong.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Fail tidak dapat disimpan kerana URL jenis %@ tidak disokong.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Fail ini tidak dapat disimpan kerana ruang tidak mencukupi.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "“%1$@” tidak dapat disalin ke “%2$@” kerana tiada ruang mencukupi.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "“%1$@” tidak dapat disambungkan ke “%2$@” kerana tiada ruang mencukupi.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "“%1$@” tidak dapat dipindahkan ke “%2$@” kerana tiada ruang mencukupi.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640(Trash).f" = "“%@” tidak dapat dipindahkan ke sampah kerana ruang tidak mencukupi.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Ruang tidak mencukupi.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Volum “%@” kekurangan ruang.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Keluarkan beberapa fail daripada volum dan kemudian cuba lagi.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Anda tidak dapat menyimpan fail “%@” kerana tiada ruang mencukupi.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Anda tidak dapat menyimpan fail “%1$@” kerana volum “%2$@” kekurangan ruang.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "Fail ini tidak dapat disimpan kerana volum adalah baca sahaja.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642(Trash).f" = "“%@” tidak dapat dipindahkan ke sampah kerana volum adalah baca sahaja.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "Volum adalah baca sahaja.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "Volum “%@” adalah baca sahaja.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Cuba menyimpan fail pada volum lain.
";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Anda tidak dapat menyimpan fail “%@” kerana volum adalah baca sahaja.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Anda tidak dapat menyimpan fail “%1$@” kerana volum \"%2$@\" adalah baca sahaja.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "Operasi tidak dapat diselesaikan. (%1$@ ralat %2$ld.)";

